#+title: A survey of Lisp family surface syntax
#+author: Thomas H Gillespie
#+email: tgbugs@gmail.com
#+date: 2021-03-06
# XXX #+email doesn't typeset correctly

# [[file:paper.pdf]]
# [[file:paper.tex]]
# [[file:paper.html]]

# #+options: toc:nil num:nil
#+options: H:3 num:nil toc:nil \n:nil ::t |:t -:t f:t *:t <:t ^:nil
#+options: d:nil todo:t pri:nil tags:not-in-toc
# TeX:t LaTeX:t skip:nil @:t

# have to call make title late in a document like this
# #+options: title:nil author:nil email:nil
#+options: title:nil
# have to defer title rendering until after the start

#+latex_class: acmart
#+latex_class_options: [format=sigconf,review]

# #+latex_header: \usepackage{dejavu}
#+latex_header: \usepackage{DejaVuSansMono}
#+latex_header: \usepackage[inkscapelatex=false]{svg}

#+latex_header: \usepackage{fontspec}
#+latex_header: \setmonofont[Scale=MatchLowercase]{DejaVu Sans Mono}
# https://tex.stackexchange.com/a/37251
#+latex_header: \newfontfamily{\dsm}{DejaVu Sans Mono}[Scale=MatchLowercase]
# #+latex_header: \newenvironment{djsm}{\dsm}{\par}

#+latex_header: \acmConference[ELS'21]{the 14th European Lisp Symposium}{May 03--04 2021}{Everywhere}
#+latex_header: \acmISBN{}
#+latex_header: \acmDOI{}
#+latex_header: \startPage{}
#+latex_header: \setcopyright{rightsretained}
#+latex_header: \copyrightyear{2021}

#+property: header-args :eval never-export

*** tokes list                                                 :noexport:
=nifstd_tools= docs for ast extraction
also pyontutils.utils asStr

#+begin_src python :epilogue "return out" :exports results
from itertools import zip_longest
from sxpyr.introspect import analysis
names = analysis()
out = [[_] for n in zip_longest(names, fillvalue='') for _ in n]
#+end_src

#+RESULTS:
| Newline                        |
| Tab                            |
| Space                          |
| List Paren Begin               |
| List Paren End                 |
| List Square Begin              |
| List Square End                |
| List Curly Begin               |
| List Curly End                 |
| String Delimiter               |
| Verbatim Atom Delimiter        |
| Dispatch                       |
| Block Comment in Dispatch      |
| Expression Comment in Dispatch |
| Heading Comment in Dispatch    |
| Keyword in Dispatch            |
| Feature Expression in Dispatch |
| Expression Comment in Dispatch |
| Quote                          |
| Quasiquote                     |
| Unquote                        |
| Unquote in Quasiquote          |
| Splice in Unquote              |
| Keyword                        |
| Escape                         |
| Escape in String               |
| Charachter                     |
| Comment                        |
| -------------                  |
| Top Level                      |
| Atom                           |
| Keyword                        |
| Quote                          |
| Unquote                        |
| Unquote First                  |
| Unquote Splicing               |
| Quasiquote                     |
| String                         |
| List Paren                     |
| List Square                    |
| List Curly                     |
| Dispatch                       |
| Comment                        |
| Escape                         |
| Escape String                  |
| Comment Expression             |
| Comment Heading                |
| Expression Feature             |
| Comment Block                  |
| Comment Block Maybe Exit       |
| Atom Verbatim                  |
| Comment Block Nested           |
| Charachter Literal             |
| Charachter Literal First       |


| token type |
| newline
| tab
| space
| list begin
| list end

***** Racket
#+begin_src racket :lang racket/base
(eq? '|a| '|\a|)
#+end_src

#+RESULTS:
: #f

***** Gambit
#+begin_src scheme :scheme gambit :session sess-gambit
(eq? '|a| '|\a|)
#+end_src

#+RESULTS:
: #f

***** Guile
#+begin_src scheme :scheme guile :session sess-guile
(eq? '|a| '|\a|)
#+end_src

#+RESULTS:
: #f

***** Chez
#+begin_src scheme :scheme chez :session sess-chez
(eq? '|a| '|\a|)
#+end_src

#+RESULTS:
: #f

** Clojure
Clojure supports a hybrid of both and follows more closely with scheme
behavior.

#+begin_src clojure
'(\newline \n "\n" "\newline" "
")
#+end_src

#+RESULTS:
: (\newline \n "\n" "\newline" "\n")

